api/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "air_quality_threshold" = $1, "city" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["air_quality_threshold", "30"], ["city", "Boston"], ["updated_at", "2021-07-18 21:46:54.831323"], ["id", 3]]